; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l4-t1-p2---int100n150-m25---int100c150---s6---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 - location
t0 - truck
p0 p1 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 - fuellevel
)

(:init
(sum level0 level2 level2)
(sum level0 level6 level6)
(sum level0 level12 level12)
(sum level0 level16 level16)
(sum level0 level19 level19)
(sum level0 level24 level24)
(sum level1 level2 level3)
(sum level1 level6 level7)
(sum level1 level12 level13)
(sum level1 level16 level17)
(sum level1 level19 level20)
(sum level1 level24 level25)
(sum level2 level2 level4)
(sum level2 level6 level8)
(sum level2 level12 level14)
(sum level2 level16 level18)
(sum level2 level19 level21)
(sum level2 level24 level26)
(sum level3 level2 level5)
(sum level3 level6 level9)
(sum level3 level12 level15)
(sum level3 level16 level19)
(sum level3 level19 level22)
(sum level3 level24 level27)
(sum level4 level2 level6)
(sum level4 level6 level10)
(sum level4 level12 level16)
(sum level4 level16 level20)
(sum level4 level19 level23)
(sum level4 level24 level28)
(sum level5 level2 level7)
(sum level5 level6 level11)
(sum level5 level12 level17)
(sum level5 level16 level21)
(sum level5 level19 level24)
(sum level5 level24 level29)
(sum level6 level2 level8)
(sum level6 level6 level12)
(sum level6 level12 level18)
(sum level6 level16 level22)
(sum level6 level19 level25)
(sum level6 level24 level30)
(sum level7 level2 level9)
(sum level7 level6 level13)
(sum level7 level12 level19)
(sum level7 level16 level23)
(sum level7 level19 level26)
(sum level7 level24 level31)
(sum level8 level2 level10)
(sum level8 level6 level14)
(sum level8 level12 level20)
(sum level8 level16 level24)
(sum level8 level19 level27)
(sum level8 level24 level32)
(sum level9 level2 level11)
(sum level9 level6 level15)
(sum level9 level12 level21)
(sum level9 level16 level25)
(sum level9 level19 level28)
(sum level9 level24 level33)
(sum level10 level2 level12)
(sum level10 level6 level16)
(sum level10 level12 level22)
(sum level10 level16 level26)
(sum level10 level19 level29)
(sum level10 level24 level34)
(sum level11 level2 level13)
(sum level11 level6 level17)
(sum level11 level12 level23)
(sum level11 level16 level27)
(sum level11 level19 level30)
(sum level11 level24 level35)
(sum level12 level2 level14)
(sum level12 level6 level18)
(sum level12 level12 level24)
(sum level12 level16 level28)
(sum level12 level19 level31)
(sum level12 level24 level36)
(sum level13 level2 level15)
(sum level13 level6 level19)
(sum level13 level12 level25)
(sum level13 level16 level29)
(sum level13 level19 level32)
(sum level13 level24 level37)
(sum level14 level2 level16)
(sum level14 level6 level20)
(sum level14 level12 level26)
(sum level14 level16 level30)
(sum level14 level19 level33)
(sum level14 level24 level38)
(sum level15 level2 level17)
(sum level15 level6 level21)
(sum level15 level12 level27)
(sum level15 level16 level31)
(sum level15 level19 level34)
(sum level15 level24 level39)
(sum level16 level2 level18)
(sum level16 level6 level22)
(sum level16 level12 level28)
(sum level16 level16 level32)
(sum level16 level19 level35)
(sum level16 level24 level40)
(sum level17 level2 level19)
(sum level17 level6 level23)
(sum level17 level12 level29)
(sum level17 level16 level33)
(sum level17 level19 level36)
(sum level18 level2 level20)
(sum level18 level6 level24)
(sum level18 level12 level30)
(sum level18 level16 level34)
(sum level18 level19 level37)
(sum level19 level2 level21)
(sum level19 level6 level25)
(sum level19 level12 level31)
(sum level19 level16 level35)
(sum level19 level19 level38)
(sum level20 level2 level22)
(sum level20 level6 level26)
(sum level20 level12 level32)
(sum level20 level16 level36)
(sum level20 level19 level39)
(sum level21 level2 level23)
(sum level21 level6 level27)
(sum level21 level12 level33)
(sum level21 level16 level37)
(sum level21 level19 level40)
(sum level22 level2 level24)
(sum level22 level6 level28)
(sum level22 level12 level34)
(sum level22 level16 level38)
(sum level23 level2 level25)
(sum level23 level6 level29)
(sum level23 level12 level35)
(sum level23 level16 level39)
(sum level24 level2 level26)
(sum level24 level6 level30)
(sum level24 level12 level36)
(sum level24 level16 level40)
(sum level25 level2 level27)
(sum level25 level6 level31)
(sum level25 level12 level37)
(sum level26 level2 level28)
(sum level26 level6 level32)
(sum level26 level12 level38)
(sum level27 level2 level29)
(sum level27 level6 level33)
(sum level27 level12 level39)
(sum level28 level2 level30)
(sum level28 level6 level34)
(sum level28 level12 level40)
(sum level29 level2 level31)
(sum level29 level6 level35)
(sum level30 level2 level32)
(sum level30 level6 level36)
(sum level31 level2 level33)
(sum level31 level6 level37)
(sum level32 level2 level34)
(sum level32 level6 level38)
(sum level33 level2 level35)
(sum level33 level6 level39)
(sum level34 level2 level36)
(sum level34 level6 level40)
(sum level35 level2 level37)
(sum level36 level2 level38)
(sum level37 level2 level39)
(sum level38 level2 level40)

(connected l0 l1)
(fuelcost level16 l0 l1)
(connected l0 l2)
(fuelcost level19 l0 l2)
(connected l0 l3)
(fuelcost level2 l0 l3)
(connected l1 l0)
(fuelcost level16 l1 l0)
(connected l1 l2)
(fuelcost level12 l1 l2)
(connected l1 l3)
(fuelcost level6 l1 l3)
(connected l2 l0)
(fuelcost level19 l2 l0)
(connected l2 l1)
(fuelcost level12 l2 l1)
(connected l2 l3)
(fuelcost level24 l2 l3)
(connected l3 l0)
(fuelcost level2 l3 l0)
(connected l3 l1)
(fuelcost level6 l3 l1)
(connected l3 l2)
(fuelcost level24 l3 l2)

(at t0 l2)
(fuel t0 level40)
(= (total-cost) 0)

(at p0 l0)
(at p1 l0)
)

(:goal
(and
(at p0 l3)
(at p1 l1)
)
)
(:metric minimize (total-cost)))

; plan
1. (drive t0 l2 l0 level21 level19 level40)
   deleted: (at t0 l2) (fuel t0 level40)
   added: (at t0 l0) (fuel t0 level21)
   goals met: 0 of 2
2. (load p1 t0 l0)
   deleted: (at p1 l0)
   added: (in p1 t0)
   goals met: 0 of 2
3. (load p0 t0 l0)
   deleted: (at p0 l0)
   added: (in p0 t0)
   goals met: 0 of 2
4. (drive t0 l0 l3 level19 level2 level21)
   deleted: (at t0 l0) (fuel t0 level21)
   added: (at t0 l3) (fuel t0 level19)
   goals met: 0 of 2
5. (unload p0 t0 l3)
   deleted: (in p0 t0)
   added: (at p0 l3)
   goals met: 1 of 2
6. (drive t0 l3 l1 level13 level6 level19)
   deleted: (at t0 l3) (fuel t0 level19)
   added: (at t0 l1) (fuel t0 level13)
   goals met: 1 of 2
7. (unload p1 t0 l1)
   deleted: (in p1 t0)
   added: (at p1 l1)
   goals met: 2 of 2
